/* Задача 15: Напишите программу, которая принимает
на вход цифру, обозначающую день недели, и проверяет, 
является ли этот день выходным.
6 -> да
7 -> да
1 -> нет */
Console.Write("Введите целое число от 1 до 7: ");
int numberday = Convert.ToInt32(Console.ReadLine());
if 
else
{
    Console.WriteLine("это НЕ ДЕНЬ НЕДЕЛИ, ВВЕДИ ОТ 1 ДО 7!!!!!");
}